# Data Set das Olímpiadas de Tokyo2021.

# Importando os Módulos

In [2]:
import numpy as np 
import pandas as pd
import os

# Lendo os Data Sets

In [5]:
import os
for dirname, _, filenames in os.walk('Olympics_Tokyo2021/data/'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

Olympics_Tokyo2021/data/Athletes.xlsx
Olympics_Tokyo2021/data/Coaches.xlsx
Olympics_Tokyo2021/data/EntriesGender.xlsx
Olympics_Tokyo2021/data/Medals.xlsx
Olympics_Tokyo2021/data/Teams.xlsx

In [11]:
Athletes = pd.read_excel('Olympics_Tokyo2021/data/Athletes.xlsx')
Coaches = pd.read_excel('Olympics_Tokyo2021/data/Coaches.xlsx')
EntriesGender = pd.read_excel('Olympics_Tokyo2021/data/EntriesGender.xlsx')
Medals = pd.read_excel('Olympics_Tokyo2021/data/Medals.xlsx')
Teams = pd.read_excel('Olympics_Tokyo2021/data/Teams.xlsx')

C:\Users\alexsandro.ignacio\AppData\Local\Programs\Python\Python39\lib\site-packages\openpyxl\styles\stylesheet.py:221: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [12]:
Athletes.head(2)

              Name     NOC           Discipline
0  AALERUD Katrine  Norway         Cycling Road
1      ABAD Nestor   Spain  Artistic Gymnastics

In [13]:
Coaches.head(2)

              Name    NOC  Discipline Event
0  ABDELMAGID Wael  Egypt    Football   NaN
1        ABE Junya  Japan  Volleyball   NaN

In [14]:
EntriesGender.head(2)

       Discipline  Female  Male  Total
0  3x3 Basketball      32    32     64
1         Archery      64    64    128

In [15]:
Medals.head(2)

,Rank,Team/NOC,Gold,Silver,Bronze,Total,Rank by Total
0,1,United States of America,39,41,33,113,1
1,2,People's Republic of China,38,32,18,88,2

In [16]:
Teams.head(2)

      Name      Discipline                         NOC Event
0  Belgium  3x3 Basketball                     Belgium   Men
1    China  3x3 Basketball  People's Republic of China   Men

In [17]:
Medals[Medals['Team/NOC'] == 'Brazil']

    Rank Team/NOC  Gold  Silver  Bronze  Total  Rank by Total
11    12   Brazil     7       6       8     21             12